Revit 2027 API
IFCExportElementType Enumeration
 An enumerated type defining if an element type is exported to IFC or not.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public enum IFCExportElementType
Public Enumeration IFCExportElementType
public enum class IFCExportElementType
type IFCExportElementType
Members
Member name | Value | Description
Default | 0 |  Export element type to IFC according to category or Revit element settings.
No | 2 |  Don't export element type to IFC regardless of category or Revit element settings.
Yes | 1 |  Export element type to IFC regardless of category or Revit element settings.
See Also
Reference
Autodesk.Revit.DB Namespace